app/views/posts/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  <div class="post_head">
  <img src="<%=User.find(post.user_id).image_url%>" width="8%">