app/controllers/like_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
UPDATE "posts" SET "liked_by" = $1, "post_likes" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["liked_by", "{1}"], ["post_likes", 1], ["updated_at", "2018-09-07 12:56:47.221932"], ["id", 15]]
---
  def create
    @post = Post.find(params['posts'['post']]['id'].to_i)
    # @post.post_likes += 1
    # @post.liked_by.push(current_user.id)
    # p 'this is the array of likes'
    # p @post.liked_by
    if @post.liked_by.include?(current_user.id.to_s)
      redirect_to posts_path
    else
      @post.post_likes += 1
      @post.liked_by.push(current_user.id)