app/controllers/posts_controller.rb

INSERT INTO "posts" ("message", "created_at", "updated_at", "username") VALUES ($1, $2, $3, $4) RETURNING "id"  [["message", "Hello, world!"], ["created_at", "2018-08-29 14:52:23.298630"], ["updated_at", "2018-08-29 14:52:23.298630"], ["username", "uwotm8@hotmail.com"]]
---
  def create
    if !post_params.nil?
      @post = Post.create(post_params)

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" ASC
---
  def index
    @posts = Post.all